KanatERPSukhova.КанатАдаптация/src/DataProcessors/КАНАТ_ОтчетГосконтрактПрокуратура/КАНАТ_ОтчетГосконтрактПрокуратура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>КАНАТ_ОтчетГосконтрактПрокуратура</name>
</mdclass:DataProcessor>

KanatERPSukhova.КанатАдаптация/src/Enums/ТипыНаправленийДеятельности/ТипыНаправленийДеятельности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="c48660c5-edbd-4c32-8897-06db07cbe865">
  <name>ТипыНаправленийДеятельности</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="c187a341-c4b3-44aa-aab0-1360e9444df6">
    <name>ГосударственныйКонтракт</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="58686353-1d16-4f22-bcab-35265a7b5744">
    <name>КонтрактГОЗ</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

KanatERPSukhova.КанатАдаптация/src/Documents/СчетНаОплатуКлиенту/СчетНаОплатуКлиенту.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="7deae7a3-c5c6-4e3a-8a69-ee8c92e40c9a">
  <name>СчетНаОплатуКлиенту</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="38171f51-f270-4a82-a089-b63c611c4f1e">
    <name>ДокументОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КАНАТ_ФормаОплаты</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КАНАТ_ИспользоватьФормуОплаты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КАНАТ_Товары</name>
    <comment>Задача 000000222</comment>
    <attributes>
      <name>ДатаОтгрузки</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидЦены</name>
      <type>
        <types>CatalogRef.ВидыЦен</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьСтавкаНДС</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>13</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентРучнойСкидки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРучнойСкидки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентАвтоматическойСкидки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаАвтоматическойСкидки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаОтмены</name>
      <type>
        <types>CatalogRef.ПричиныОтменыЗаказовКлиентов</types>
      </type>
    </attributes>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отменено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>СрокПоставки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Содержание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусУказанияСерий</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВариантОбеспечения</name>
      <type>
        <types>EnumRef.ВариантыОбеспечения</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураНабора</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Обособленно</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаНабора</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВариантОбеспеченияДоИзмененияОбновлениемИБ</name>
      <type>
        <types>EnumRef.ВариантыОбеспечения</types>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураПартнера</name>
      <type>
        <types>CatalogRef.НоменклатураКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаБонусныхБалловКСписанию</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаБонусныхБалловКСписаниюВВалюте</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНачисленныхБонусныхБалловВВалюте</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СпособДоставки</name>
      <comment>Из объекта ДокументОснование</comment>
      <type>
        <types>EnumRef.СпособыДоставки</types>
      </type>
    </attributes>
    <attributes>
      <name>ПеревозчикПартнер</name>
      <type>
        <types>CatalogRef.Партнеры</types>
      </type>
    </attributes>
    <attributes>
      <name>Грузополучатель</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>НеОтгружатьЧастями</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОтгрузкиОснования</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресДоставки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КАНАТ_ПлатитЗаДоставку</name>
      <type>
        <types>EnumRef.КАНАТ_ПлатитЗаДоставку</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

KanatERPSukhova.КанатАдаптация/src/Documents/СчетФактураВыданный/СчетФактураВыданный.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="9eab2298-ca44-4cc2-a529-95431e0e3800">
  <name>СчетФактураВыданный</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="861dd4a6-11fe-4e8a-94aa-230cc1037aa1">
    <name>Договор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f5ebb45d-36cc-4d4e-aaae-5effa624ce42">
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="fd65fde8-b84e-417c-a0f6-6d991416b565">
    <name>ДокументОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="a96d4ac2-d10a-4fee-87a1-589480786aff">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="8a622e4b-561c-49a4-97dd-da5615b0c95f">
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="50371f97-7440-48ec-8481-2c7e9c812287">
    <name>ПлатежноРасчетныеДокументы</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="043d3fd2-2de7-4440-9727-ac6351b61a5e">
      <name>НомерПлатежноРасчетногоДокумента</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>30</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="7b0e9642-7b63-4ca0-b12e-34bdd79511b9">
      <name>ДатаПлатежноРасчетногоДокумента</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

KanatERPSukhova.КанатАдаптация/src/Documents/ПоступлениеБезналичныхДенежныхСредств/ПоступлениеБезналичныхДенежныхСредств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="59afd471-d060-43ed-bc09-86b5b5a4a65b">
  <name>ПоступлениеБезналичныхДенежныхСредств</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="b8035e62-52e0-4355-84d9-d94eb6a26ede">
    <name>ДатаВходящегоДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="2e0a18f5-6ad1-45e9-95a8-f10e597efa5c">
    <name>НомерВходящегоДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="592bf0ba-feb4-4dc0-ae2e-d417e510e025">
    <name>Договор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="d4822dd8-1037-4c98-9be7-a73bb03d013a">
    <name>РасшифровкаПлатежа</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="d7783d31-f359-4bce-bf82-8a31afa21d5d">
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

KanatERPSukhova.КанатАдаптация/src/Catalogs/ГосударственныеКонтракты/ГосударственныеКонтракты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="150b7e79-b2ba-4802-8c98-0fb39df77a4a">
  <name>ГосударственныеКонтракты</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="44f46d80-32d9-47d2-94e4-81c4f7139f4a">
    <name>НомерИГК</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="eb40c87b-9005-456d-b42f-f3b6a887cee5">
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2cddc38e-54ee-405d-ab65-b99a6675c8d5">
    <name>ПредметКонтракта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="06d38dba-215d-40b4-8d80-1a415a672df8">
    <name>Номер</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="4a3012a7-a307-43fa-99df-9112aa5d6559">
    <name>ДатаЗаключения</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="45ba24f8-10ba-476f-9192-af80cb30a623">
    <name>ВнутреннийИдентификаторЕИС</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>19</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="8cdf14cd-5534-4834-8b09-97d008f577ef">
    <name>ТипНаправленияДеятельности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Catalog>

KanatERPSukhova.КанатАдаптация/src/DataProcessors/КАНАТ_ОтчетГосконтрактПрокуратура/Forms/Форма/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИзменитьДоступностьЭлементов();
	
КонецПроцедуры


&НаСервере
Процедура ИзменитьДоступностьЭлементов()
	
	Если ИспользоватьГосконтракт Тогда
		Элементы.Госконтракт.Доступность = Истина;
	Иначе
		Госконтракт = Перечисления.ТипыНаправленийДеятельности.ПустаяСсылка();
		Элементы.Госконтракт.Доступность = Ложь;
	КонецЕсли;
	
	Если ИспользоватьПлательщик Тогда
		Элементы.Плательщик.Доступность = Истина;
	Иначе
		Плательщик = Справочники.Контрагенты.ПустаяСсылка();
		Элементы.Плательщик.Доступность = Ложь;
	КонецЕсли;
	
	Если ИспользоватьПериод Тогда
		Элементы.Период.Доступность = Истина;
	Иначе
		Период.ДатаНачала= Дата("00010101");
		Период.ДатаОкончания = ТекущаяДата();
		Элементы.Период.Доступность = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьПериодПриИзменении(Элемент)
	ИзменитьДоступностьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьПлательщикПриИзменении(Элемент)
	ИзменитьДоступностьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьГосконтрактПриИзменении(Элемент)
	ИзменитьДоступностьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура Печать(Команда)
	ТабличныйДокумент = СформироватьТабличныйДокумент();
	
	Идентификатор = "ОтчетГособоронзаказПериод";
	КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм(Идентификатор);
	
	КоллекцияПечатныхФорм[0].ТабличныйДокумент = ТабличныйДокумент;
	КоллекцияПечатныхФорм[0].Экземпляров = 1;
	КоллекцияПечатныхФорм[0].СинонимМакета = "Отчет о реализации по гособоронзаказам за период";
	
	УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм,Неопределено,ЭтаФорма);
	
КонецПроцедуры 

&НаСервере
Функция СформироватьТабличныйДокумент()
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Обработка.КАНАТ_ОтчетГосконтрактПрокуратура.КАНАТ_ПФ_МакетГосконтрактПрокуратура");
	
	//Шапка
	ОбластьШапка = Макет.ПолучитьОбласть("ОбластьШапка");
	
	Организация = БухгалтерскийУчетПереопределяемый.ПолучитьЗначениеПоУмолчанию("ОсновнаяОрганизация");
	ИНН = Организация.ИНН;
	
	ДанныеШапки = Новый Структура;
	//ДанныеШапки.Вставить("Организация", Организация);
	ДанныеШапки.Вставить("ГодНачало", Формат(Период.ДатаНачала, "ДФ=yyyy"));
	ДанныеШапки.Вставить("ГодОкончание", Формат(Период.ДатаОкончания, "ДФ=yyyy"));
	ДанныеШапки.Вставить("ИНН", ИНН);
	
	ОбластьШапка.Параметры.Заполнить(ДанныеШапки);
	ТабличныйДокумент.Вывести(ОбластьШапка);
	
	//Таблица
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ОбластьШапкаТаблицы");
	ТабличныйДокумент.Вывести(ОбластьШапкаТаблицы);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МАКСИМУМ(ЗаказКлиентаТовары.ДатаОтгрузки) КАК ДатаОтгрузки,
		|	ЗаказКлиентаТовары.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТДатыОтгрузки
		|ИЗ
		|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказКлиентаТовары.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СчетНаОплатуКлиенту.ДокументОснование КАК ДокументОснование,
		|	МАКСИМУМ(СчетНаОплатуКлиенту.Дата) КАК Дата
		|ПОМЕСТИТЬ ВТПоследниеСчетаНаОплату
		|ИЗ
		|	Документ.СчетНаОплатуКлиенту КАК СчетНаОплатуКлиенту
		|
		|СГРУППИРОВАТЬ ПО
		|	СчетНаОплатуКлиенту.ДокументОснование
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		//БИТ_Гурьев__17.12.24++
		|	Контрагенты.Наименование КАК Организация,
		|	Контрагенты.ИНН КАК ИНН,
		|	СчетФактураВыданный.Представление КАК СчетФактура,
		|	ГосударственныеКонтракты.НомерИГК КАК НомерИГК,
		|	ГосударственныеКонтракты.Номер КАК ГосконтрактНомер,
		|	ГосударственныеКонтракты.ДатаЗаключения КАК ГосконтрактДата,
		|	ДоговорыКонтрагентов.Сумма КАК СуммаДоговора,
		|	СчетНаОплатуКлиенту.Представление КАК СчетНаОплату,
		|	РеализацияТоваровУслуг.Представление КАК РеализацияТоваровУслуг,
		|	ВЫБОР
		|		КОГДА ЗаказКлиентаТаблица.НеОтгружатьЧастями
		|			ТОГДА ЗаказКлиентаТаблица.ДатаОтгрузки
		|		ИНАЧЕ ВТДатыОтгрузки.ДатаОтгрузки
		|	КОНЕЦ КАК СрокИсполнения,
		|	ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Сумма КАК ОплатаСумма,
		|	ГосударственныеКонтракты.Наименование КАК ПредметДоговора,
		|	ДоговорыКонтрагентов.Номер КАК ДоговорНомер,
		|	СчетНаОплатуКлиенту.Номер КАК СчетНаОплатуНомер,
		|	СчетНаОплатуКлиенту.Дата КАК СчетНаОплатуДата,
		|	СчетНаОплатуКлиенту.СуммаДокумента КАК СчетНаОплатуСуммаДокумента,
		|	СчетФактураВыданный.Номер КАК СчетФактураВыданныйНомер,
		|	СчетФактураВыданный.Дата КАК СчетФактураВыданныйДата,
		|	РеализацияТоваровУслуг.Номер КАК РеализацияТоваровУслугНомер,
		|	РеализацияТоваровУслуг.Дата КАК РеализацияТоваровУслугДата,
		|	ПоступлениеБезналичныхДенежныхСредств.Дата КАК ОплатаДата,
		|	РеализацияТоваровУслуг.СуммаДокумента КАК СуммаПоУПД
		//БИТ_Гурьев__17.12.24--
		|ИЗ
		|	Документ.СчетФактураВыданный КАК СчетФактураВыданный
		|		ПОЛНОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК ЗаказКлиентаТаблица
		|				ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетНаОплатуКлиенту КАК СчетНаОплатуКлиенту
		|					ЛЕВОЕ СОЕДИНЕНИЕ ВТПоследниеСчетаНаОплату КАК ВТПоследниеСчетаНаОплату
		|					ПО СчетНаОплатуКлиенту.ДокументОснование = ВТПоследниеСчетаНаОплату.ДокументОснование
		|				ПО ЗаказКлиентаТаблица.Ссылка = СчетНаОплатуКлиенту.ДокументОснование
		|				ЛЕВОЕ СОЕДИНЕНИЕ ВТДатыОтгрузки КАК ВТДатыОтгрузки
		|				ПО ЗаказКлиентаТаблица.Ссылка = ВТДатыОтгрузки.Ссылка
		|			ПО РеализацияТоваровУслуг.ЗаказКлиента = ЗаказКлиентаТаблица.Ссылка
		|		ПО СчетФактураВыданный.ДокументОснование = РеализацияТоваровУслуг.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ГосударственныеКонтракты КАК ГосударственныеКонтракты
		|			ПО ДоговорыКонтрагентов.ГосударственныйКонтракт = ГосударственныеКонтракты.Ссылка
					//БИТ_Гурьев__17.12.24++
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
		|			ПО Контрагенты.Ссылка = ДоговорыКонтрагентов.Контрагент
					//БИТ_Гурьев__17.12.24--
		|		ПО СчетФактураВыданный.Договор = ДоговорыКонтрагентов.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеБезналичныхДенежныхСредств КАК ПоступлениеБезналичныхДенежныхСредств
		|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеБезналичныхДенежныхСредств.РасшифровкаПлатежа КАК ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа
		|			ПО (ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка = ПоступлениеБезналичныхДенежныхСредств.Ссылка)
		|		ПО СчетФактураВыданный.Договор = ПоступлениеБезналичныхДенежныхСредств.Договор
		|			И (ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.НомерСтроки = 1)
		|ГДЕ
		|	ДоговорыКонтрагентов.ДоговорСУчастникомГОЗ = ИСТИНА
		|	И (СчетФактураВыданный.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|			ИЛИ НЕ &ИспользоватьПериод)
		|	И (СчетФактураВыданный.Контрагент = &Плательщик
		|			ИЛИ НЕ &ИспользоватьПлательщик)
		|	И (ГосударственныеКонтракты.Ссылка = &Госконтракт
		|			ИЛИ НЕ &ИспользоватьГосконтракт)
		|	И ВТПоследниеСчетаНаОплату.Дата = СчетНаОплатуКлиенту.Дата
		|	И СчетФактураВыданный.Проведен = ИСТИНА
		|	И СчетФактураВыданный.ПометкаУдаления = ЛОЖЬ
		|	И ДоговорыКонтрагентов.ПометкаУдаления = ЛОЖЬ
		|	И ГосударственныеКонтракты.ПометкаУдаления = ЛОЖЬ
		|ИТОГИ ПО
		|	СчетФактура";
	
	Запрос.УстановитьПараметр("Госконтракт", Госконтракт);
	Запрос.УстановитьПараметр("ИспользоватьГосконтракт", ИспользоватьГосконтракт);
	Запрос.УстановитьПараметр("ИспользоватьПериод", ИспользоватьПериод);
	Запрос.УстановитьПараметр("ИспользоватьПлательщик", ИспользоватьПлательщик);
	Запрос.УстановитьПараметр("КонецПериода", Период.ДатаОкончания);
	Запрос.УстановитьПараметр("НачалоПериода", Период.ДатаНачала);
	Запрос.УстановитьПараметр("Плательщик", Плательщик);
	
	ВыборкаСчетФактура = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Счетчик = 0;
	
	Пока ВыборкаСчетФактура.Следующий() Цикл
		
		Счетчик = Счетчик + 1;
		
		ОбластьСтрокаТаблицы = Макет.ПолучитьОбласть("ОбластьСтрокаТаблицы");
		ЗаполнитьОбщиеПоля = Истина;
		
		ДанныеТаблицы = Новый Структура;
		
		Выборка = ВыборкаСчетФактура.Выбрать();
		
		Оплата = "";
		
		Пока Выборка.Следующий() Цикл
			
			Если ЗаполнитьОбщиеПоля Тогда
			
				ДанныеТаблицы.Вставить("ПП", Счетчик);
				ДанныеТаблицы.Вставить("ДанныеГосконтракта", СтрШаблон("%1 от %2 ИГК: %3",
																	   Выборка.ДоговорНомер,
																	   Формат(Выборка.ГосконтрактДата, "ДФ=dd.MM.yy"),
																	   Выборка.НомерИГК));
				ДанныеТаблицы.Вставить("Организация", Выборка.Организация);
				ДанныеТаблицы.Вставить("ИНН", Выборка.ИНН);
				ДанныеТаблицы.Вставить("СуммаДоговораНДС", Формат(Выборка.СуммаДоговора, "ЧДЦ=2"));
				ДанныеТаблицы.Вставить("ПредметДоговора", Выборка.ПредметДоговора);
				ДанныеТаблицы.Вставить("Счета", СтрШаблон("%1 от %2",
														  ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Выборка.СчетФактураВыданныйНомер),
														  Формат(Выборка.СчетФактураВыданныйДата,  "ДФ=dd.MM.yy")));
				ДанныеТаблицы.Вставить("Накладная", СтрШаблон("%1 от %2", 
															  ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Выборка.РеализацияТоваровУслугНомер),
															  Формат(Выборка.РеализацияТоваровУслугДата,  "ДФ=dd.MM.yy")));
				ДанныеТаблицы.Вставить("Срок", Формат(Выборка.СрокИсполнения, "ДФ=dd.MM.yy"));
				//БИТ_Гурьев__18.12.24++
				ДанныеТаблицы.Вставить("СчетНаОплату", СтрШаблон("%1 от %2", 
																 ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Выборка.СчетНаОплатуНомер),
																 Формат(Выборка.СчетНаОплатуДата, "ДФ=dd.MM.yy")));
				ДанныеТаблицы.Вставить("СуммаСчетаНаОплату", Формат(Выборка.СчетНаОплатуСуммаДокумента, "ЧДЦ=2"));
				ДанныеТаблицы.Вставить("СуммаПоУПД", Формат(Выборка.СуммаПоУПД, "ЧДЦ=2"));
				//БИТ_Гурьев__18.12.24--
			
			КонецЕсли;
			
			ЗаполнитьОбщиеПоля = Ложь;
			
			Если Не ПустаяСтрока(Оплата) Тогда
				
				Оплата = Оплата + Символы.ПС;
				
			КонецЕсли;
			
			Оплата = Оплата + СтрШаблон("%1 руб., %2", Формат(Выборка.ОплатаСумма, "ЧДЦ=2"), Формат(Выборка.ОплатаДата, "ДФ=dd.MM.yy"));
			
		КонецЦикла;
		
		ДанныеТаблицы.Вставить("Оплата", Оплата);
		
		ОбластьСтрокаТаблицы.Параметры.Заполнить(ДанныеТаблицы);
		ТабличныйДокумент.Вывести(ОбластьСтрокаТаблицы);
		
	КонецЦикла;
	
	
	Возврат ТабличныйДокумент;
	
КонецФункции
